#include <iostream>
#include <vector>
using namespace std;

void div()
{
    /**

    1 считываются числа в червяка
    2 выводится каждая версия червяка как циклического буфера (после каждого шага/продвижения на одно число)
    3 для каждого шага червяка выводится его содержимое и минимальное пройденное число
    4 для каждого шага червяка выводится пара из числа в зубах и минимального пройденного
    5 ищется минимум среди сгенерированных пар, удовлетворяющих условию номер 2 (кратно ли числу)

    **/


}
int main()
{
    div();
    return 0;
}
